In [1]:
import pandas as pd

In [2]:
pd.__version__

'1.2.0'

In [4]:
ser = pd.Series(['zhangsan', 'lisi', 'wangwu'])
ser

0    zhangsan
1        lisi
2      wangwu
dtype: object

In [5]:
list(range(1,4))

[1, 2, 3]

In [6]:
ser = pd.Series(['zhangsan', 'lisi', 'wangwu'], index = list(range(1,4)))
ser

1    zhangsan
2        lisi
3      wangwu
dtype: object

In [7]:
ser[2]

'lisi'

In [8]:
ser[2]= 'jack'

In [9]:
ser

1    zhangsan
2        jack
3      wangwu
dtype: object

In [11]:
ind = [1, 3]
ser[ind]

1    zhangsan
3      wangwu
dtype: object

In [14]:
ser[[1,2]]

1    zhangsan
2        jack
dtype: object

In [15]:
ser.values

array(['zhangsan', 'jack', 'wangwu'], dtype=object)

In [16]:
type(ser.values)

numpy.ndarray

In [17]:
ser2 = pd.Series([12, 16, 17], index = range(1,4))
ser2

1    12
2    16
3    17
dtype: int64

In [18]:
ser2 + 1

1    13
2    17
3    18
dtype: int64

In [19]:
ser2[ser2%2==0]

1    12
2    16
dtype: int64

In [20]:
data = {'beijing': 9240, 'shanghai': 8876, 'guangzhou': 7738}
ser3 = pd.Series(data)
ser3

beijing      9240
shanghai     8876
guangzhou    7738
dtype: int64

In [22]:
ser3['beijing']

9240

In [24]:
'beijing' in ser3

True

In [25]:
ser3.to_dict()

{'beijing': 9240, 'shanghai': 8876, 'guangzhou': 7738}

In [26]:
ser3.to_list()

[9240, 8876, 7738]

In [30]:
ser3.to_json()

'{"beijing":9240,"shanghai":8876,"guangzhou":7738}'

In [31]:
ser3.to_frame()

              0
beijing    9240
shanghai   8876
guangzhou  7738

## DataFrame

In [4]:
import numpy as np

In [41]:
data = np.arange(100, 109).reshape(3,-1)
data

array([[100, 101, 102],
       [103, 104, 105],
       [106, 107, 108]])

In [42]:
df = pd.DataFrame(data)
df

     0    1    2
0  100  101  102
1  103  104  105
2  106  107  108

In [23]:
data = {
    'nanme': ['jack', 'mary', 'lili'],
    'age': [19, 19, 17],
    'height': [1.68, 1.77, 1.98]
}
df = pd.DataFrame(data)
df

  nanme  age  height
0  jack   19    1.68
1  mary   19    1.77
2  lili   17    1.98

In [24]:
df.columns

Index(['nanme', 'age', 'height'], dtype='object')

In [19]:
df.columns = ['username', 'age', 'height']

In [20]:
df

  username  age  height
0     jack   19    1.68
1     mary   19    1.77
2     lili   17    1.98

In [12]:
df = pd.DataFrame(data, columns = ['username', 'age', 'height', 'email'])
df

  username  age  height email
0      NaN   19    1.68   NaN
1      NaN   19    1.77   NaN
2      NaN   17    1.98   NaN

In [13]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [14]:
df = pd.DataFrame(data, columns = ['username', 'age', 'height', 'email'], index = range(1,4))
df

  username  age  height email
1      NaN   19    1.68   NaN
2      NaN   19    1.77   NaN
3      NaN   17    1.98   NaN

In [25]:
df = pd.DataFrame(data, columns = ['nanme', 'age', 'height', 'email'], index = range(1,4))
df

  nanme  age  height email
1  jack   19    1.68   NaN
2  mary   19    1.77   NaN
3  lili   17    1.98   NaN

In [46]:
data = {
    'name': ['jack', 'mary', 'lili', 'liuliu'],
    'age': [19, 19, 17, 20],
    'height': [1.68, 1.77, 1.98, 166]
}
df = pd.DataFrame(data, columns=['name', 'age', 'height'])
df

     name  age  height
0    jack   19    1.68
1    mary   19    1.77
2    lili   17    1.98
3  liuliu   20  166.00

In [27]:
df['name']

0      jack
1      mary
2      lili
3    liuliu
Name: name, dtype: object

In [28]:
df.age

0    19
1    19
2    17
3    20
Name: age, dtype: int64

In [29]:
df[['name']]

     name
0    jack
1    mary
2    lili
3  liuliu

In [41]:
df[['name', 'age']]

       name  age
0  zhangsan   19
1      mary   19
2      lili   17
3    liuliu   20

In [44]:
names = df['name']
names[0] = 'zhangsan'

<ipython-input-44-3ff3d53ff5e7>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  names[0] = 'zhangsan'

In [34]:
names

0    zhangsan
1        mary
2        lili
3      liuliu
Name: name, dtype: object

In [38]:
pd.DataFrame(names)

       name
0  zhangsan
1      mary
2      lili
3    liuliu

In [39]:
df

       name  age  height
0  zhangsan   19    1.68
1      mary   19    1.77
2      lili   17    1.98
3    liuliu   20  166.00

In [47]:
# 进行copy后，更改属性后不影响DF的值
names = df.name.copy()
names

0      jack
1      mary
2      lili
3    liuliu
Name: name, dtype: object

In [48]:
names[0] = 'wangba'
names

0    wangba
1      mary
2      lili
3    liuliu
Name: name, dtype: object

In [49]:
df

     name  age  height
0    jack   19    1.68
1    mary   19    1.77
2    lili   17    1.98
3  liuliu   20  166.00

In [50]:
df.columns

Index(['name', 'age', 'height'], dtype='object')

In [51]:
df.columns[1:3]

Index(['age', 'height'], dtype='object')

In [52]:
df[df.columns[1:3]]

   age  height
0   19    1.68
1   19    1.77
2   17    1.98
3   20  166.00

In [53]:
df

     name  age  height
0    jack   19    1.68
1    mary   19    1.77
2    lili   17    1.98
3  liuliu   20  166.00

In [54]:
import datetime

In [57]:
df['year'] = datetime.datetime.now().year - df.age
df

     name  age  height  year
0    jack   19    1.68  2001
1    mary   19    1.77  2001
2    lili   17    1.98  2003
3  liuliu   20  166.00  2000

In [56]:
df.drop('year', axis = 1)

     name  age  height
0    jack   19    1.68
1    mary   19    1.77
2    lili   17    1.98
3  liuliu   20  166.00

In [58]:
df.drop(['year', 'height'], axis = 1)

     name  age
0    jack   19
1    mary   19
2    lili   17
3  liuliu   20

In [59]:
df

     name  age  height  year
0    jack   19    1.68  2001
1    mary   19    1.77  2001
2    lili   17    1.98  2003
3  liuliu   20  166.00  2000

In [64]:
df.drop(df.columns[1::2], axis = 1)

     name  height
0    jack    1.68
1    mary    1.77
2    lili    1.98
3  liuliu  166.00

In [65]:
df

     name  age  height  year
0    jack   19    1.68  2001
1    mary   19    1.77  2001
2    lili   17    1.98  2003
3  liuliu   20  166.00  2000

In [67]:
df.loc[1]

name      mary
age         19
height    1.77
year      2001
Name: 1, dtype: object

In [68]:
df.loc[[1]]

   name  age  height  year
1  mary   19    1.77  2001

In [72]:
df.loc[[1, 3]]

     name  age  height  year
1    mary   19    1.77  2001
3  liuliu   20  166.00  2000

In [73]:
# 不知道索引值，知道想要的数据，想要最后两个数据  name 和 age
df.index

RangeIndex(start=0, stop=4, step=1)

In [76]:
df.loc[df.index[-2:]]

     name  age  height  year
2    lili   17    1.98  2003
3  liuliu   20  166.00  2000

In [77]:
df.loc[df.index[-2:], ['name','age']]

     name  age
2    lili   17
3  liuliu   20

In [78]:
df.loc[df.index[-2:], ['age','year']]

   age  year
2   17  2003
3   20  2000

In [79]:
df

     name  age  height  year
0    jack   19    1.68  2001
1    mary   19    1.77  2001
2    lili   17    1.98  2003
3  liuliu   20  166.00  2000

In [85]:
df.shape

(4, 4)

In [86]:
#在最后一行插入数据
df.loc[df.shape[0]] = {'age':21, 'name':'wangbadan','height':1.4, 'year':'2008'}

In [87]:
df

        name  age  height  year
0       jack   19    1.68  2001
1       mary   19    1.77  2001
2       lili   17    1.98  2003
3     liuliu   20  166.00  2000
4  wangbadan   21    1.40  2008

In [88]:
df2 = df.drop(2)
df2

        name  age  height  year
0       jack   19    1.68  2001
1       mary   19    1.77  2001
3     liuliu   20  166.00  2000
4  wangbadan   21    1.40  2008

In [98]:
df2.index = range(df2.shape[0])

In [99]:
df2

        name  age  height  year
0       jack   19    1.68  2001
1       mary   19    1.77  2001
2     liuliu   20  166.00  2000
3  wangbadan   21    1.40  2008

In [100]:
df

        name  age  height  year
0       jack   19    1.68  2001
1       mary   19    1.77  2001
2       lili   17    1.98  2003
3     liuliu   20  166.00  2000
4  wangbadan   21    1.40  2008
5    choucha   33    2.40  2018

In [103]:
df2 = df.drop(2)
df2

        name  age  height  year
0       jack   19    1.68  2001
1       mary   19    1.77  2001
3     liuliu   20  166.00  2000
4  wangbadan   21    1.40  2008
5    choucha   33    2.40  2018

In [104]:
df2.loc[2]

KeyError: 2

In [105]:
df2.iloc[2] #底层内存中存储的物理顺序

name      liuliu
age           20
height     166.0
year        2000
Name: 3, dtype: object

In [106]:
df2.index = range(df2.shape[0])

In [107]:
df2

        name  age  height  year
0       jack   19    1.68  2001
1       mary   19    1.77  2001
2     liuliu   20  166.00  2000
3  wangbadan   21    1.40  2008
4    choucha   33    2.40  2018

In [116]:
df2.index = list(range(1,6))
df2

        name  age  height  year
1       jack   19    1.68  2001
2       mary   19    1.77  2001
3     liuliu   20  166.00  2000
4  wangbadan   21    1.40  2008
5    choucha   33    2.40  2018

In [113]:
df2.iloc[1:3]

     name  age  height  year
2    mary   19    1.77  2001
3  liuliu   20  166.00  2000

In [118]:
df2

        name  age  height  year
1       jack   19    1.68  2001
2       mary   19    1.77  2001
3     liuliu   20  166.00  2000
4  wangbadan   21    1.40  2008
5    choucha   33    2.40  2018

In [119]:
df2.iat[1, 1]

19

In [120]:
df2.iat[1, 1] = 66
df2

        name  age  height  year
1       jack   19    1.68  2001
2       mary   66    1.77  2001
3     liuliu   20  166.00  2000
4  wangbadan   21    1.40  2008
5    choucha   33    2.40  2018

In [121]:
df2.iat[1,2] = 2.00
df2

        name  age  height  year
1       jack   19    1.68  2001
2       mary   66    2.00  2001
3     liuliu   20  166.00  2000
4  wangbadan   21    1.40  2008
5    choucha   33    2.40  2018

## 使用比较运算符进行筛选数据

In [124]:
df2['height'] >= 1.65

1     True
2     True
3     True
4    False
5     True
Name: height, dtype: bool

In [125]:
df2[df2['height'] >= 1.65]

      name  age  height  year
1     jack   19    1.68  2001
2     mary   66    2.00  2001
3   liuliu   20  166.00  2000
5  choucha   33    2.40  2018

In [128]:
df2[(df2['height'] >= 1.65) & (df2['age'] <= 20)]

     name  age  height  year
1    jack   19    1.68  2001
3  liuliu   20  166.00  2000

In [138]:
df.query('height >= 1.65 and age <=20 or name == "jack" ')

     name  age  height  year
0    jack   19    1.68  2001
1    mary   19    1.77  2001
2    lili   17    1.98  2003
3  liuliu   20  166.00  2000

In [139]:
age = 20
df.query('age < @age')

   name  age  height  year
0  jack   19    1.68  2001
1  mary   19    1.77  2001
2  lili   17    1.98  2003

In [140]:
df['age'].isin([18, 19])

0     True
1     True
2    False
3    False
4    False
5    False
Name: age, dtype: bool

In [143]:
df[df['age'].isin([19, 17])]

   name  age  height  year
0  jack   19    1.68  2001
1  mary   19    1.77  2001
2  lili   17    1.98  2003

In [144]:
df.T

           0     1     2       3          4        5
name    jack  mary  lili  liuliu  wangbadan  choucha
age       19    19    17      20         21       33
height  1.68  1.77  1.98   166.0        1.4      2.4
year    2001  2001  2003    2000       2008     2018

## pandas 导入数据

### 导入TXT

In [145]:
pd.read_table('./test/1.txt')

            email
0  1234@gmail.com
1    1234@163.com
2     1234@qq.com

In [147]:
#读取单列数据
pd.read_table('./test/2.txt')

        99999
0       fsafs
1  gfgfgfgfgf
2      gdfgfd
3         gtr
4          tr

In [20]:
pd.read_table('./test/2.txt')

   name  age           email
0  jack   18  jack@gmail.com
1  mark   19    mark@163.com
2  lily   17  lily@gmail.com
3   tom   20      tom@qq.com
4   joe   16   joe@gmail.com

In [5]:
pd.read_table('./test/3.txt', sep =  ':', header = None)

        0  1  2  3       4          5                  6
0    root  x  0  0     rot      /root          /bin/bash
1  daemon  x  1  1  daemon  /usr/sbin  /usr/sbin/nologin
2     bin  x  2  2     bin       /bin  /usr/sbin/nologin

In [27]:
pd.read_table('./test/3.txt', sep =  ':', header = None, names = ['name', 'pwd', 'uid', 'gid', 'local', 'home', 'shell'])

     name pwd  uid  gid   local       home              shell
0    root   x    0    0     rot      /root          /bin/bash
1  daemon   x    1    1  daemon  /usr/sbin  /usr/sbin/nologin
2     bin   x    2    2     bin       /bin  /usr/sbin/nologin

## CSV格式

In [28]:
pd.read_csv('./test/4.csv', header = None)

        0    1
0  afanda  aaa
1     bbb  ddd
2     sss  ccc
3     555  ttt

## excel导入

In [34]:
# pip install xlrd
pf3 = pd.read_excel('./test/one.xlsx')
pf3.index = list(range(1, 1000))
pf3

            时间 销售员   商品    售价  渠道   城市  大区 财务员   销量   浏览量 分组
1   2019-11-27  田七   手表  2632  京东   深圳  华南  周财  164  1799  C
2   2010-06-25  张三   手表  2632  国美   深圳  华南  孙财  100  1937  B
3   2018-12-23  张三  平衡车  2861  国美   西安  西北  赵财  101  1988  A
4   2018-10-09  田七   手机  2935  京东   西安  西北  孙财  149  1607  C
5   2016-06-24  赵六   耳机  4936  线下   沈阳  东北  李财  117  1129  D
..         ...  ..  ...   ...  ..  ...  ..  ..  ...   ... ..
995 2012-11-29  田七   手机  2935  国美   西安  西北  赵财  180  1428  D
996 2013-05-15  张三   平板  2077  苏宁   北京  华北  赵财  191  1906  D
997 2020-06-29  大花   电脑  3132  国美   北京  华北  孙财  144  1422  A
998 2010-01-07  大花   耳机  4936  苏宁   上海  华东  钱财  165  1441  C
999 2014-01-12  李四   平板  2077  淘宝  石家庄  华北  孙财  167  1856  D

[999 rows x 11 columns]

## html

In [8]:
# 安装 pip install lxml
tables = pd.read_html('./test/05.html', header = 0)

In [16]:
tables[0]

   排名   城市    工资
1   1   北京  9024
2   2  大上海  8962
3   3   深圳  8315
4   4   广州  7409
5   5   杭州  7330

In [15]:
tables[0].index = list(range(1,6))

In [23]:
tables = pd.read_html('./test/05.html', header = 0, attrs = {'class': 'mydata'})
tables

[   排名   城市    工资
 0   1   北京  9024
 1   2  大上海  8962
 2   3   深圳  8315
 3   4   广州  7409
 4   5   杭州  7330]

In [35]:
len(tables)

NameError: name 'shape' is not defined

## mysql

In [38]:
import pymysql

In [39]:
con = pymysql.connect(host='localhost', user = 'root', password = '12345', database = 'recommend', charset = 'utf8', use_unicode = True)

# sql命令
sql_cmd = 'select * from status'

df = pd.read_sql(sql_cmd, con)

In [40]:
df.head(2)

   id content
0   1    继续跟单
1   2   非意向用户

## sort

In [42]:
st = pd.Series(list('CAD'), index = [3, 1, 2])
st

3    C
1    A
2    D
dtype: object

In [43]:
st.sort_index()

1    A
2    D
3    C
dtype: object

In [45]:
st.sort_values()

1    A
3    C
2    D
dtype: object

In [46]:
st.sort_index(ascending=False)

3    C
2    D
1    A
dtype: object

In [47]:
st.sort_values(ascending=False)

2    D
3    C
1    A
dtype: object

In [48]:
arr = [[9, 4, 8],
      [5, 9, 3],
      [2, 5, 4]
      ]

In [49]:
df = pd.DataFrame(arr, index = [0, 2, 1], columns = list('cab'))
df

   c  a  b
0  9  4  8
2  5  9  3
1  2  5  4

In [52]:
df.sort_index(axis = 1)

   a  b  c
0  4  8  9
2  9  3  5
1  5  4  2

In [53]:
# 对dataFrame 某一series排序
df.sort_values(by = 'c')

   c  a  b
1  2  5  4
2  5  9  3
0  9  4  8

In [54]:
df.sort_values(by = 'c', ascending = False)

   c  a  b
0  9  4  8
2  5  9  3
1  2  5  4

df.sort_values(by  = ['c', 'a'])

## rank

In [58]:
df

   c  a  b
0  9  4  8
2  5  9  3
1  2  5  4

In [59]:
df.rank()

     c    a    b
0  3.0  1.0  3.0
2  2.0  3.0  1.0
1  1.0  2.0  2.0

In [60]:
df.rank(method = 'first')

     c    a    b
0  3.0  1.0  3.0
2  2.0  3.0  1.0
1  1.0  2.0  2.0

In [61]:
df.rank(method='max')

     c    a    b
0  3.0  1.0  3.0
2  2.0  3.0  1.0
1  1.0  2.0  2.0

## merge

In [5]:
import numpy as np

In [5]:
df1 = pd.DataFrame(
    { 'stu_no':['s1','s2','s1','s3','s1','s1','s2','s4'],
      'score' : np.random.randint(50, 100, size=8)                  
    }

)
df1

  stu_no  score
0     s1     58
1     s2     73
2     s1     76
3     s3     50
4     s1     95
5     s1     83
6     s2     83
7     s4     83

In [67]:
np.random.randint(50, 100, size=8)

array([84, 92, 61, 76, 93, 71, 68, 67])

In [6]:
df2 = pd.DataFrame(
   {  'stu_no':['s1','s2','s3','s5'],
      'name':['zhangsan', 'lisi', 'wangwu', 'zhaoliu']                
    }
)
df2

  stu_no      name
0     s1  zhangsan
1     s2      lisi
2     s3    wangwu
3     s5   zhaoliu

In [10]:
pd.merge(df1, df2, on = 'stu_no')  #属于 inner join 链接方式，两个表数据需要一一对应

  stu_no  score      name
0     s1     58  zhangsan
1     s1     76  zhangsan
2     s1     95  zhangsan
3     s1     83  zhangsan
4     s2     73      lisi
5     s2     83      lisi
6     s3     50    wangwu

In [11]:
#左连接
pd.merge(df1, df2, on = 'stu_no', how = 'left')

  stu_no  score      name
0     s1     58  zhangsan
1     s2     73      lisi
2     s1     76  zhangsan
3     s3     50    wangwu
4     s1     95  zhangsan
5     s1     83  zhangsan
6     s2     83      lisi
7     s4     83       NaN

In [12]:
# 右链接
pd.merge(df1, df2, on = 'stu_no', how = 'right')

  stu_no  score      name
0     s1   58.0  zhangsan
1     s1   76.0  zhangsan
2     s1   95.0  zhangsan
3     s1   83.0  zhangsan
4     s2   73.0      lisi
5     s2   83.0      lisi
6     s3   50.0    wangwu
7     s5    NaN   zhaoliu

In [13]:
#外连接
pd.merge(df1, df2, on = 'stu_no', how = 'outer')

  stu_no  score      name
0     s1   58.0  zhangsan
1     s1   76.0  zhangsan
2     s1   95.0  zhangsan
3     s1   83.0  zhangsan
4     s2   73.0      lisi
5     s2   83.0      lisi
6     s3   50.0    wangwu
7     s4   83.0       NaN
8     s5    NaN   zhaoliu

## concat 合并 数据拼接

In [20]:
df1 = pd.DataFrame(np.arange(1,5).reshape(2,-1))
df1

   0  1
0  1  2
1  3  4

In [22]:
df2 = pd.DataFrame(np.zeros((2,2)))
df2

     0    1
0  0.0  0.0
1  0.0  0.0

In [24]:
#纵向叠加
pd.concat([df1, df2])

     0    1
0  1.0  2.0
1  3.0  4.0
0  0.0  0.0
1  0.0  0.0

In [25]:
pd.concat([df1, df2], axis = 1)

   0  1    0    1
0  1  2  0.0  0.0
1  3  4  0.0  0.0

## 异常值的分析

In [28]:
data = [[1, None],
        [4, 5],
        [None, None],
        [8,9],
        [3,4]
       ]
df = pd.DataFrame(data, columns=['a','b'])
df

     a    b
0  1.0  NaN
1  4.0  5.0
2  NaN  NaN
3  8.0  9.0
4  3.0  4.0

In [30]:
df.head(2)

     a    b
0  1.0  NaN
1  4.0  5.0

In [31]:
df.tail(3)

     a    b
2  NaN  NaN
3  8.0  9.0
4  3.0  4.0

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       4 non-null      float64
 1   b       3 non-null      float64
dtypes: float64(2)
memory usage: 208.0 bytes

In [34]:
df.describe()

             a         b
count  4.00000  3.000000
mean   4.00000  6.000000
std    2.94392  2.645751
min    1.00000  4.000000
25%    2.50000  4.500000
50%    3.50000  5.000000
75%    5.00000  7.000000
max    8.00000  9.000000

In [35]:
df.count()

a    4
b    3
dtype: int64

In [37]:
df.mean()

a    4.0
b    6.0
dtype: float64

In [38]:
df.sum()

a    16.0
b    18.0
dtype: float64

In [39]:
df.sum(axis = 1)

0     1.0
1     9.0
2     0.0
3    17.0
4     7.0
dtype: float64

In [40]:
df.a

0    1.0
1    4.0
2    NaN
3    8.0
4    3.0
Name: a, dtype: float64

In [41]:
df.a.sum()

16.0

In [42]:
df.std()  #标准差

a    2.943920
b    2.645751
dtype: float64

In [43]:
df.var()  #方差      方差开根号是标准差

a    8.666667
b    7.000000
dtype: float64

### 标准差越小波动越小

In [44]:
# 计算方差
my_var = np.mean((df.a - df.a.mean()) ** 2)

In [46]:
my_var

6.5

In [47]:
df.max()

a    8.0
b    9.0
dtype: float64

In [48]:
df.max(axis = 1)

0    1.0
1    5.0
2    NaN
3    9.0
4    4.0
dtype: float64